posts/2019-06-03-customel-snippets/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Custom.el Snippets</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Custom.el Snippets</h1>
</header><p>
My Emacs configuration contains a <code>custom.el</code> file, which should contain custom
code that is only relevant on a specific machine. That's why this file is not
tracked using git. More and more bits of useful snippets show up in my
<code>custom.el</code> file and I'd like to jot down some examples which I might expand on
in the future.
</p>

<div id="outline-container-org18993a1" class="outline-2">
<h2 id="org18993a1">Calling Command Line Tools</h2>
<div class="outline-text-2" id="text-org18993a1">
<p>
This snippet is inspired by <a href="https://hackeryarn.com/post/cli-in-emacs/">a blog post</a> which I've found on /r/emacs. The elisp
function calls the PowerShell function <code>Invoke-Formatter</code>, which is part of the
<a href="https://github.com/PowerShell/PSScriptAnalyzer">PSScriptAnalyzer</a> PowerShell module:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/pspretty-buffer ()
  (interactive)
  (shell-command-on-region (point-min) (point-max) "powershell.exe -Command \"$script = $input | Out-String; Invoke-Formatter $script\" " t t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org953d3f3" class="outline-2">
<h2 id="org953d3f3">Org-Mode Agenda</h2>
<div class="outline-text-2" id="text-org953d3f3">
<p>
After seeing <a href="https://www.reddit.com/r/emacs/comments/9v7ut1/screenshot_showcase_2018/">this post</a>, I've decided to dive into creating my own agenda. I'm
using a custom agenda view to keep track of things I have to do while I am at
work. The custom view show my scheduled tasks for the next three days, as well
as all unscheduled tasks, sorted by their TODO statement (e.g. "TODO", "WAIT" or
"DONE"):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-agenda-custom-commands
      '(("." "Overview (Custom)"
         ((agenda ""
                  ((org-agenda-span 3)
                   (org-agenda-start-on-weekday nil)
                   (org-agenda-show-future-repeats 'next)
                   (org-agenda-scheduled-leaders '("" ""))
                   (org-agenda-overriding-header "* Calendar\n")))
          (todo ""
                ((org-agenda-overriding-header "\n* Open\n")
                 (org-agenda-block-separator nil)
                 (org-agenda-sorting-strategy '(todo-state-up))
                 (org-agenda-todo-ignore-scheduled 'all)))
          ))))

(set-face-attribute 'org-agenda-structure nil :inherit 'default :height 1.25)
</pre>
</div>

<p>
The custom headers make the agenda look like a regular org-mode file. Enabling
<code>(orgstruct-mode)</code> on the agenda buffer allows me to hide and show sections.
</p>

<p>
I haven't come around to like <code>org-capture</code>, so for now I've created this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/home ()
  (interactive)
  (delete-other-windows)
  (find-file "~/org/projects.org")
  (split-window-horizontally)
  (other-window 1)
  (org-agenda nil ".")
  (split-window-vertically)
  (other-window 1)
  (find-file (concat "~/org/" (format-time-string "%Y-%m-%d") ".org"))
  (other-window 1))

(global-set-key (kbd "&lt;f12&gt;") 'fw/home)
</pre>
</div>

<p>
Pressing <code>F12</code> opens up my "home" view, which consists of my projects-overview
file, my custom agenda, as well as a date stamped file which I use to keep track
of unexpected issues, thoughts and ideas.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-06-03</p>
<footer>
<p>Copyright 2023, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>